config.org
#+TITLE: Emacs Config

* Personal Information
#+BEGIN_SRC emacs-lisp
(setq user-full-name "Eoin Carney"
      user-mail-address "eoincarney0@gmail.com")
#+END_SRC
* Appearance
** Font and Theme
#+BEGIN_SRC emacs-lisp
(setq doom-font
    (font-spec :family "FuraMono Nerd Font" :size 16)
    ;; (font-spec :family "FuraMono Nerd Font" :size 16)
    mixed-pitch-set-height 20
    doom-variable-pitch-font (font-spec :family "Source Sans Pro" :size 20))
;; (set-default line-spacing 0.3)

(setq doom-theme 'doom-challenger-deep)
#+END_SRC
** Dashboard
#+BEGIN_SRC emacs-lisp
(defun doom-dashboard-draw-ascii-emacs-banner-fn ()
    (let* ((banner
            '(" Y88b      /     "
              "  Y88b    /      "
              "   Y88b  /       "
              "    Y888/        "
              "     Y8/         "
              "      Y          "))

           (longest-line (apply #'max (mapcar #'length banner))))
     (put-text-property
      (point)
      (dolist (line banner (point))
       (insert (+doom-dashboard--center
                +doom-dashboard--width
                (concat
                 line (make-string (max 0 (- longest-line (length line)))
                       32)))
        "\n"))
      'face 'doom-dashboard-banner)))

;; unless (display-graphic-p) ; for some reason this messes up the graphical splash screen atm
(setq +doom-dashboard-ascii-banner-fn #'doom-dashboard-draw-ascii-emacs-banner-fn)

(custom-set-faces!
    '(doom-dashboard-banner :foreground "slategray"))
#+END_SRC
* General Settings
** Load custom functions
#+begin_src emacs-lisp
(load! "my.el")

#+end_src
** Misc
+ Modeline word count - DISABLED - slows down org significantly in larger files
+ Time in modeline
+ Set opacity here so it works with Xcompmgr
+ Relative line numbers
+ Scroll Margin
+ Map j/k as gj/gk
+ open .gmi in markdown mode
+ mixed pitch mode for markdown mode :refile:
+ Rebind for eshell
+ Auto save (super save)
+ No line numbers
#+BEGIN_SRC emacs-lisp
;; (setq doom-modeline-enable-word-count t)
(display-time-mode 1)
;; (add-to-list 'default-frame-alist '(alpha . 90))
(setq display-line-numbers 'relative
      scroll-margin 5)
(define-key evil-normal-state-map (kbd "j") 'evil-next-visual-line)
(define-key evil-normal-state-map (kbd "k") 'evil-previous-visual-line)
;; (add-to-list 'auto-mode-alist '("\\.gmi\\'" . markdown-mode))
(add-hook! markdown-mode 'mixed-pitch-mode)
(map! :n "SPC o t" 'eshell)
;; center line on scroll
(map! :n "C-d" (lambda ()(interactive)(evil-scroll-down 0)(recenter)))
(map! :n "C-u" (lambda ()(interactive)(evil-scroll-up 0)(recenter)))
(super-save-mode 1)
(setq super-save-when-idle t)
(setq display-line-numbers-type t)

#+END_SRC
** Encryption
+ Enable [[https://orgmode.org/worg/org-tutorials/encrypting-files.html][encryption]]
#+begin_src emacs-lisp
(require 'epa-file)
(epa-file-enable)
(setq epa-pinentry-mode 'loopback)
(require 'org-crypt)
(org-crypt-use-before-save-magic)
(setq org-tags-exclude-from-inheritance (quote ("crypt")))
;; GPG key to use for encryption
;; Either the Key ID or set to nil to use symmetric encryption.
(setq org-crypt-key nil)
#+end_src
** Buffer Previews
Maybe not really necessary
#+begin_src emacs-lisp
(setq evil-vsplit-window-right t
    evil-split-window-below t)
(defadvice! prompt-for-buffer (&rest _)
    :after '(evil-window-split evil-window-vsplit)
    (+ivy/switch-buffer))
(setq +ivy-buffer-preview t)
#+end_src
** Browsers
Set qutebrowser as default and elpher start page
#+begin_src emacs-lisp
(setq browse-url-generic-program "/usr/bin/brave")
(setq browse-url-browser-function 'browse-url-generic)
(setq elpher-start-page-url "gemini://warmedal.se/~antenna/")
#+end_src
* Org
** Directories and misc
#+BEGIN_SRC emacs-lisp
(setq org-directory "~/docs/org/"
      ;; org-roam-directory (concat org-directory "notes/")
      bibtex-completion-bibliography (concat org-directory "lib.bib"))
(after! org
  (setq org-agenda-files (append (directory-files-recursively (concat org-directory "act/") "\\.org$")
                                 (directory-files-recursively (concat org-directory "notes/") "\\notes.org$"))))

(add-to-list 'org-modules 'org-id)
(require 'ox-gemini)
(require 'ox-hugo)
#+END_SRC
** Extra keybindings
#+begin_src emacs-lisp
(map!
 :n "<f5>" 'org-agenda
 :n "<f6>" (lambda() (interactive)(find-file (concat org-directory "act/inbox.org")))
 :n "<f7>" (lambda() (interactive)(find-file (concat org-directory "act/projects.org")))
 :n "<f8>" (lambda() (interactive)(find-file (concat org-directory "act/actions.org")))
 :n "<f9>" (lambda() (interactive)(find-file (concat org-directory "act/2023Goals.org"))))

(map! :leader :desc "Toggle Org Link Display" :n "t L" #'org-toggle-link-display)

#+end_src
** To-do keywords
#+BEGIN_SRC emacs-lisp
(after! org
  (setq org-todo-keywords
     '((sequence
        "TODO(o)"
        "TT(t)"
        "PROJ(p)"
        "NEXT(n)"
        "PROG(i!/!)"
        "WAIT(w)"
        "SOMEDAY(s)"
        "RLX(r)"
        "STUCK(x)"
        "BUY(b)"
        "|"
        "DONE(d!/!)"
        "CANCELLED(c!/!)"))))
#+END_SRC
** Org Agenda
#+begin_src emacs-lisp
(defun no-of-TTs ()
  (number-to-string (length (org-map-entries t "/+TT" 'agenda))))

(defun completed-YTD ()
  (number-to-string
   (- (length
       (org-map-entries t "/+DONE"
                        '("~/docs/org/act/archive.org"))) 4)))

(setq gtd/next-action-head (concat "NEXT ACTIONS " "-" (no-of-TTs) " -" (completed-YTD))
      gtd/waiting-head "Waiting on"
      gtd/project-head "Projects"
      gtd/read-head "Reading List"
      gtd/watch-head "Watch List"
      gtd/shop-head "Shopping"
      gtd/someday-head "Someday/maybe")

(setq org-agenda-custom-commands
      '(
        ("g" "GTD view"
         (
          (my/print-elements-of-list (my/agenda-past-dailies))
          (todo "TT" ((org-agenda-overriding-header gtd/next-action-head)))
          (agenda "" ((org-agenda-span 'day)
                      (org-agenda-start-day 'nil))) ;; this is needed because doom starts agenda with day set to -3d
          (todo "PROJ" ((org-agenda-overriding-header gtd/project-head)))
          (todo "WAIT" ((org-agenda-overriding-header gtd/waiting-head)))
          (tags-todo "read" ((org-agenda-overriding-header gtd/read-head)))
          (tags-todo "watch" ((org-agenda-overriding-header gtd/watch-head)))
          (todo "BUY"  ((org-agenda-overriding-header gtd/shop-head)))))
        ("s" "Someday"
         ((todo "SOMEDAY" ((org-agenda-overriding-header gtd/someday-head)))))))


#+end_src
** Aesthetics
Org superstar and changing height of headings

The =add-hook!= used to be =after! org= but the title never loaded properly. The add hook seems to fix it, but I should still look into a better way to do it...
Seems to slow down the first time you open an org file, but then no delay.
*** Org mode hook
#+begin_src emacs-lisp
(add-hook! 'org-mode-hook #'+org-pretty-mode #'mixed-pitch-mode #'org-superstar-mode #'org-pretty-table-mode #'org-appear-mode)
#+end_src
*** Heading Face Sizes
#+BEGIN_SRC emacs-lisp
;; (add-hook! org-mode
;;     (setq org-hidden-keywords '(title))
;;     (set-face-attribute 'org-level-8 nil :weight 'bold :inherit 'default)
;;     (set-face-attribute 'org-level-7 nil :inherit 'org-level-8)
;;     (set-face-attribute 'org-level-6 nil :inherit 'org-level-8)
;;     (set-face-attribute 'org-level-5 nil :inherit 'org-level-8)
;;     (set-face-attribute 'org-level-4 nil :inherit 'org-level-8 :height 1.02)
;;     (set-face-attribute 'org-level-3 nil :inherit 'org-level-8 :height 1.08)
;;     (set-face-attribute 'org-level-2 nil :inherit 'org-level-8 :height 1.12)
;;     (set-face-attribute 'org-level-1 nil :inherit 'org-level-8 :height 1.2)
;;     (set-face-attribute 'org-document-title nil :inherit 'org-level-8 :height 1.6 :foreground 'unspecified)
;;     (setq org-n-level-faces 4)
;;     (setq org-cycle-level-faces nil))
(add-hook! org-mode
  (setq org-hidden-keywords '(title))
  (custom-set-faces
   '(org-document-title ((t (:height 2.0))))
   '(org-level-1 ((t (:inherit outline-1 :height 1.15))))
   '(org-level-2 ((t (:inherit outline-2 :height 1.12))))
   '(org-level-3 ((t (:inherit outline-3 :height 1.08))))
   '(org-level-4 ((t (:inherit outline-4 :height 1.0))))
   '(org-level-5 ((t (:inherit outline-5 :height 1.0))))))

#+END_SRC
