config.el
  (setq org-superstar-headline-bullets-list '("◉" "○" "✹" "◦"))
    ;; Other bullets I liked: "❁" "❃" "✹" "✦" "❁" "◉" "○" "◦" "♠" "♥" "♦" "♣"
  (setq org-superstar-special-todo-items t)
  (setq org-superstar-todo-bullet-alist '(
                                          ("TODO" . 9744)
                                          ("TT"   . 9744)
                                          ("NEXT" . 9744)
                                          ("CONFIG" . 9744)
                                          ("DONE" . 9747)))
  (setq org-ellipsis " ▼")
  (setq org-list-demote-modify-bullet
        '(("+" . "*")("*" . "-")("-" . "+")))
  (setq org-todo-keyword-faces '(
                                 ("TODO" . "#b16286")
                                 ("TT"   . "#b16286")
                                 ("PROJ" . "#83a598")
                                 ("WAIT" . "#a89984")
                                 ("SOMEDAY" . "#8ec07c")
                                 ("RLX" . "#6495ed"))))

(font-lock-add-keywords 'org-mode
                          '(("^ *\\([-]\\) "
                             (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

(customize-set-variable
 'org-capture-templates '(("t" "Task")
                          ("tt" "TT" entry (id "cd9ffc7d-d197-4521-b74d-4b1f93b301ca")
                           "* TT %?\n%i\n%a" :prepend t)
                          ("ti" "Inbox (Store Link)" entry (id "84c646ea-11de-4593-99a5-39f3f8ead4ef")
                           "* TODO %?\n%i\n%a" :prepend t)
                          ("to" "Inbox (No Link)" entry (id "84c646ea-11de-4593-99a5-39f3f8ead4ef")
                           "* TODO %?\n%i" :prepend t)
                          ;; Projects
                          ("p" "Project")
                          ("pp" "Project" entry (id "a359813e-8bde-463d-8406-0d5fa76357dd")
                           "* PROJ %?\n%i- [ ] Next Action:\n%a" :prepend t)
                          ("pb" "Project (Blog)" entry (id "a359813e-8bde-463d-8406-0d5fa76357dd")
                           "* PROJ %? :blog:\n%i- [ ] Next Action:\n%a" :prepend t)
                          ("pf" "Project (Fiction)" entry (id "a359813e-8bde-463d-8406-0d5fa76357dd")
                           "* PROJ %? :fiction:\n%i- [ ] Next Action:\n%a" :prepend t)
                          ("pc" "Project (Config)" entry (id "a359813e-8bde-463d-8406-0d5fa76357dd")
                           "* PROJ %? :config:\n%i- [ ] Next Action:\n%a" :prepend t)
                          ;; Shopping
                          ("s" "Shopping" entry (id "18eb88f1-b6df-4775-98ed-5852a8d3a3e1")
                           "** BUY %?" :prepend t)
                          ;; Downtime
                          ("d" "Downtime")
                          ("dw" "Watch" entry (id "0433acd7-424a-4e85-ad0d-d8d915ae6b1f")
                           "** RLX %?" :prepend t)
                          ("dr" "Read" entry (id "0b68cd14-d647-4d06-98aa-dc8bfa7e819a")
                           "** RLX %?" :prepend t)
                          ("dl" "Listen" entry (id "574f5fc4-4632-4eb8-8613-6fe105849dde")
                           "** RLX %?" :prepend t)
                          ("w" "weekly-review" entry (id "8c8faea9-b85b-4b90-845e-dfdbefb55442")
                           "* Week %(format-time-string \"%W\")")))


;; (after! org-roam
;;   (setq org-roam-capture-templates
;;         '(("d" "default" plain "#+created: %u\n#+filetags: %^G\n\n* ${title}\n%?"
;;            :target (file+head "rafts/%<%Y%m%d>-${slug}.org"
;;                               "#+title: ${title}\n")
;;            :unnarrowed t
;;            :jump-to-captured t)
;;           ("e" "encrypted" plain "#+created: %u\n#+filetags: %^G\n\n* ${title}\n%?"
;;            :target (file+head "rafts/%<%Y%m%d>-${slug}.org.gpg"
;;                               "#+title: ${title}\n")
;;            :unnarrowed t
;;            :jump-to-captured t)
;;           ("r" "reference" plain "#+created: %u\n#+filetags: ref: %^G\n\n* ${title}\n%?"
;;            :target (file+head "rafts/%<%Y%m%d>-${slug}.org"
;;                               "#+title: ${title}\n")
;;            :unnarrowed t
;;            :jump-to-captured t)
;;           ("b" "box3" plain "#+date: %u\n#+filetags: :box3: %^G\n#+hugo_custom_front_matter: :layout note\n\n%?"
;;            :target (file+head "ref/%<%Y%m%d>-${slug}.org"
;;                               "#+title: ${title}\n")
;;            :unnarrowed t)
;;           ("q" "quick" plain "#+created: %u\n#+filetags: %^G\n\n%?"
;;            :target (file+head "rafts/%<%Y%m%d>-${slug}.org"
;;                               "#+title: ${title}\n")
;;            :unnarrowed t)))
;;   (setq org-roam-dailies-capture-templates
;;         '(("d" "default" entry "* %<%H:%M> -  [[id:477e986a-2fba-4982-8158-b309baf0b14b][%?]]"
;;            :target (file+head "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n#+filetags: :dailies:\n")
;;            :jump-to-captured t))))

(require 'denote-org-dblock)
(setq denote-directory (expand-file-name "~/docs/org/notes/"))
(setq denote-templates
        '((box3 . "#+hugo_custom_front_matter: :layout note\n\n")))
(setq denote-infer-keywords t)
(setq denote-sort-keywords t)

(defun denote-journal-with-title ()
  "Create an entry tagged 'journal', while prompting for a title."
  (interactive)
  (denote
   (denote--title-prompt) ; ask for title, instead of using human-readable date
   '("journal")))

;; Like `denote-subdirectory' but also ask for a template
(defun denote-subdirectory-with-template ()
  "Create note while also prompting for a template and subdirectory.

This is equivalent to calling `denote' when `denote-prompts' is
set to '(template subdirectory title keywords)."
  (declare (interactive-only t))
  (interactive)
  (let ((denote-prompts '(template subdirectory title keywords)))
    (call-interactively #'denote)))


(setq denote-dired-directories
      (list denote-directory))


(add-hook 'dired-mode-hook #'denote-dired-mode-in-directories)

(defun my-denote-org-extract-subtree ()
  "Create new Denote note using current Org subtree.
Make the new note use the Org file type, regardless of the value
of `denote-file-type'.

Use the subtree title as the note's title.  If available, use the
tags of the heading are used as note keywords.

Delete the original subtree."
  (interactive)
  (if-let ((text (org-get-entry))
           (heading (org-get-heading :no-tags :no-todo :no-priority :no-comment)))
      (progn
        (delete-region (org-entry-beginning-position) (org-entry-end-position))
        (denote heading (org-get-tags) 'org)
        (insert text))
    (user-error "No subtree to extract; aborting")))
