config.el

;; (map! :map org-roam-mode-map
;;     :leader
;;     :prefix "r"
;;     :desc "Find Note"         "r"     'org-roam-node-find
;;     :desc "Insert Note"       "i"     'org-roam-node-insert
;;     :desc "Insert immediate"  "m"     'my/org-roam-insert-no-capture
;;     :desc "Toggle Buffer"     "b"     'org-roam-buffer-toggle
;;     :desc "Add Tag"           "t"     'org-roam-tag-add
;;     :desc "Bibtex Link"       "c"     'orb-insert-link)
;; (map! :map org-roam-mode-map
;;     :leader
;;     :prefix "r d"
;;     :desc "Daily Capture"     "c"     'org-roam-dailies-capture-today
;;     :desc "Daily Find"        "f"     'org-roam-dailies-find-directory
;;     :desc "Daily Today"       "t"     'org-roam-dailies-find-today
;;     :desc "Daily Date"        "d"     'org-roam-dailies-goto-date)

(map!
    :leader
    :prefix "r"
    :desc "Find Note"                   "r"     'denote-open-or-create
    :desc "Insert Note with signature"  "I"     'denote-signature
    :desc "Insert Note"                 "i"     'denote
    :desc "Insert Link to note"         "l"     'denote-link
    :desc "Toggle Buffer"               "b"     'denote-link-backlinks
    :desc "Box3 Entry"                  "x"     'denote-subdirectory-with-template
    :desc "Journal Entry"               "j"     'denote-journal-with-title)
(map!
    :leader
    :prefix "r n"
    :desc "Add Keywords"                 "t"    'denote-keywords-add
    :desc "Rename File using Frontmatter""r"    'denote-rename-file-using-front-matter
    :desc "Rename File and Frontmatter"  "R"    'denote-rename-file
    :desc "Insert Links matching regx"   "i"    'denote-link-add-links
    :desc "convert org subhead 2 note"   "c"    'my-denote-org-extract-subtree)

;; New link type for Org-Hugo internal links
(defun md-hugo-insert-link ()
    "Create link with Hugo ref shortcode"
    (interactive)
    (insert (concat "[" (read-string "Text for link: ") "]" "\({{< ref \"" (file-relative-name (read-file-name "File: ")) "\" >}}\)")))

(map! :map markdown-mode-map
    :leader
    :desc "Insert Hugo Link"         "m l"     'md-hugo-insert-link)

(org-babel-do-load-languages
 'org-babel-load-languages
 '((ledger . t)))

(setq-default elfeed-search-filter "@1-week-ago +unread ")
(use-package! elfeed-org
    :after elfeed
    :init
    (setq rmh-elfeed-org-files (list "~/.config/doom/elfeed.org")))
(require 'elfeed-goodies)
(elfeed-goodies/setup)
(setq elfeed-goodies/entry-pane-size 0.7)

(with-eval-after-load 'browse-url
  (add-to-list 'browse-url-handlers
                (cons "." #'browse-url-generic))
  (add-to-list 'browse-url-handlers
                  (cons "youtu\\.?be" #'view-youtube-url)))

(map! :leader
        "y y" #'my/get-url-at-point
        "y e" #'my/eww-browse-url
        "y E" #'my/eww-readable-url
        "y o" #'browse-url-generic
        "y O" #'my/view-readable-webpage-handler)

(setq +org-capture-emails-file (concat org-directory "act/inbox.org"))
(after! mu4e
  (setq mu4e-get-mail-command "offlineimap")
  (setq mu4e-update-interval 300)
  (setq mail-user-agent 'mu4e-user-agent)

  (setq mu4e-sent-folder "/[Gmail].Sent Mail")
  (setq mu4e-drafts-folder "/[Gmail].Drafts")
  (setq mu4e-trash-folder "/[Gmail].Bin")
  (setq mu4e-maildir-shortcuts
        '((:maildir "/INBOX" :key ?i)))
  (setq user-mail-address "eoincarney0@gmail.com"
        user-full-name "Eoin Carney")
  (setq sendmail-program "/usr/bin/msmtp"
        send-mail-function 'smtpmail-send-it
        message-sendmail-f-is-evil t
        message-sendmail-extra-arguments '("--read-envelope-from")
        message-send-mail-function 'message-send-mail-with-sendmail))

(defun tildechat ()
    (interactive)
    (erc-tls :server "irc.tilde.chat"
     :port 6697
     :nick "eoin"
     :full-name "eoin carney"
     :client-certificate
     '("/home/eoin/.local/share/certs/erc.key"
       "/home/eoin/.local/share/certs/erc.crt")))
(defun liberachat ()
    (interactive)
    (erc-tls :server "irc.libera.chat"
     :port 6697
     :nick "loopdreams"
     :full-name "loopdreams"
     :client-certificate
     '("/home/eoin/.local/share/certs/erc.key"
       "/home/eoin/.local/share/certs/erc.crt")))

(defun ledger-clean-and-save ()
  (interactive)
  (ledger-mode-clean-buffer)
  (save-buffer))
(map! :localleader
      (:map ledger-mode-map
       "c" #'ledger-clean-and-save))
(add-to-list 'auto-mode-alist '("\\.dat\\'" . ledger-mode))

(set-file-template! "\\.html$" :trigger "__spoolfive.html" :mode 'web-mode)

(defcustom centered-point-position 0.45
    "Percentage of screen where `centered-point-mode' keeps point."
    :type 'float)

(setq centered-point--preserve-pos nil)

(define-minor-mode centered-point-mode
    "Keep the cursor at `centered-point-position' in the window"
    :lighter " centerpoint"
    (cond (centered-point-mode (add-hook 'post-command-hook 'center-point nil t)
           (setq centered-point--preserve-pos
            scroll-preserve-screen-position)
           (setq-local scroll-preserve-screen-position 'all))
     (t (remove-hook 'post-command-hook 'center-point t)
      (setq-local scroll-preserve-screen-position
       centered-point--preserve-pos))))

(defun center-point ()
    "Move point to the line at `centered-point-position'."
    (interactive)
    (when (eq (current-buffer) (window-buffer))
     (let ((recenter-positions (list centered-point-position)))
      (recenter-top-bottom))))

(defun centered-point-mode-on ()
    (centered-point-mode 1))

(define-globalized-minor-mode global-centered-point-mode centered-point-mode
    centered-point-mode-on)

(map! :leader
