config.el
    "Z" 'display-fill-column-indicator-mode
    "z" 'display-line-numbers-mode
    "t o" 'olivetti-mode)

;; (add-hook! (writeroom-mode olivetti-mode) 'centered-point-mode-on)
;; (add-hook! 'writeroom-mode-enable-hook '(lambda () (display-line-numbers-mode -1)))
(remove-hook! (writeroom-mode) #'+zen-enable-mixed-pitch-mode-h) ;; added this since mixed-pitch is defaul on most 'writing' files (org, md). Otherwise, when exiting writeroom mode, font switched back to fixed-pitch

(flycheck-define-checker vale
    "A checker for prose"
    :command ("vale" "--output" "line"
              source)
    :standard-input nil
    :error-patterns
    ((error line-start (file-name) ":" line ":" column ":" (id (one-or-more (not (any ":")))) ":" (message) line-end))
    :modes (markdown-mode))
    
(add-to-list 'flycheck-checkers 'vale 'append)
(setq flycheck-checker-error-threshold 2000)
(global-flycheck-mode -1)

(add-hook! (gemini-mode) #'mixed-pitch-mode)

(setq writeroom-width 60)

(defun my/writing ()
  (interactive)
  (setq org-hidden-keywords '(title))
  (set-face-attribute 'org-level-8 nil :weight 'bold :inherit 'default)
  (set-face-attribute 'org-level-7 nil :inherit 'org-level-8)
  (set-face-attribute 'org-level-6 nil :inherit 'org-level-8)
  (set-face-attribute 'org-level-5 nil :inherit 'org-level-8)
  (set-face-attribute 'org-level-4 nil :inherit 'org-level-8 :height 1.02)
  (set-face-attribute 'org-level-3 nil :inherit 'org-level-8 :height 1.08)
  (set-face-attribute 'org-level-2 nil :inherit 'org-level-8 :height 1.12)
  (set-face-attribute 'org-level-1 nil :inherit 'org-level-8 :height 1.2)
  (set-face-attribute 'org-document-title nil :inherit 'org-level-8 :height 1.6 :foreground 'unspecified)
  (setq org-n-level-faces 4)
  (setq org-cycle-level-faces nil))

(defun my/edit ()
  (interactive)
  (call-interactively #'org-wc-display))
;; set up flycheck vale to only start here

(add-hook! conf-xdefaults-mode
  (setq comment-start "/* "
        comment-end "*/"))
